[
  {
    "id": "twomillion",
    "title": "TwoMillion",
    "os": "Linux",
    "difficulty": "Easy",
    "pwnedDate": "24 Feb 2026",
    "avatar": "https://raw.githubusercontent.com/DiogoCoutoooo/Cybersec-Obsidian/main/Tought%20Process/!Media/!Logo_TwoMillion.png",
    "description": "Analysis of a minified JavaScript file revealed an internal API used for invite code generation. Deobfuscating the code and making a POST request provided a Base64-encoded invite string. After registering and gaining access to the dashboard, an API enumeration revealed an administrative endpoint at /api/v1/admin/settings/update. By manipulating the JSON parameters in a PUT request, the current user account was elevated to administrative status.This provided access to the /api/v1/admin/vpn/generate endpoint, which was found to be vulnerable to OS Command Injection via the username parameter. Exploiting this vulnerability yielded a reverse shell as www-data. Local enumeration identified cleartext database credentials in a .env file. Password reuse of these credentials allowed for a successful SSH login as the admin user, providing access to the user flag.TODO: root flag",
    "matrix": {
      "ENUM": 60,
      "REAL": 60,
      "CVE": 60,
      "CUSTOM": 40,
      "CTF": 40
    },
    "folder": "Easy"
  },
  {
    "id": "cap",
    "title": "Cap",
    "os": "Linux",
    "difficulty": "Easy",
    "pwnedDate": "21 Feb 2026",
    "avatar": "https://raw.githubusercontent.com/DiogoCoutoooo/Cybersec-Obsidian/main/Tought%20Process/!Media/!Logo_Cap.png",
    "description": "Exposed IDOR vulnerability in the web dashboard allowed for the download of other users' network captures. Analysis of a specific PCAP file revealed cleartext FTP credentials. After gaining a shell, local enumeration showed that Python 3.8 was configured with dangerous capabilities (cap_setuid,cap_net_bind_service+eip). This misconfiguration allowed for an immediate privilege escalation to root by manipulating the process UID via a simple python script.",
    "matrix": {
      "ENUM": 50,
      "REAL": 40,
      "CVE": 40,
      "CUSTOM": 50,
      "CTF": 60
    },
    "folder": "Easy"
  },
  {
    "id": "expressway",
    "title": "Expressway",
    "os": "Linux",
    "difficulty": "Easy",
    "pwnedDate": "18 Feb 2026",
    "avatar": "https://raw.githubusercontent.com/DiogoCoutoooo/Cybersec-Obsidian/main/Tought%20Process/!Media/!Logo_Expressway.png",
    "description": "Exposed IKE port allowed for aggressive mode sniffing, leading to the crack of a Pre-Shared Key (PSK). This provided access to a VPN tunnel where internal services were reachable. After pivoting, a cleartext password was found in a configuration file, granting SSH access. Final privilege escalation was achieved by exploiting a misconfigured SUID binary to execute commands as root.",
    "matrix": {
      "ENUM": 80,
      "REAL": 80,
      "CVE": 20,
      "CUSTOM": 30,
      "CTF": 60
    },
    "folder": "Easy"
  }
]