[
  {
    "id": "twomillion",
    "title": "TwoMillion",
    "os": "Linux",
    "difficulty": "Easy",
    "pwnedDate": "26 Feb 2026",
    "avatar": "https://raw.githubusercontent.com/DiogoCoutoooo/Cybersec-Obsidian/main/Tought%20Process/!Media/!Logo_TwoMillion.png",
    "description": "Analysis of minified JS revealed an API for invite code generation, yielding a Base64-encoded string via a POST request. After registration, API enumeration of the /api/v1/admin/settings/update endpoint allowed for administrative privilege escalation through JSON parameter manipulation in a PUT request. This provided access to /api/v1/admin/vpn/generate, where OS Command Injection in the username parameter yielded a reverse shell as www-data. Local enumeration uncovered database credentials in a .env file, which were reused to gain SSH access as admin. Finally, the system was found vulnerable to CVE-2023-0386 (OverlayFS). By leveraging FUSE to craft a malicious SUID binary and triggering a \"copy-up\" operation, the kernel failed to strip the SUID bit when moving the file to the host's upper directory. Executing this binary granted root privileges, allowing for the retrieval of the final flag.",
    "matrix": {
      "ENUM": 60,
      "REAL": 60,
      "CVE": 60,
      "CUSTOM": 40,
      "CTF": 40
    },
    "folder": "Easy",
    "status": "PWNED"
  },
  {
    "id": "cap",
    "title": "Cap",
    "os": "Linux",
    "difficulty": "Easy",
    "pwnedDate": "21 Feb 2026",
    "avatar": "https://raw.githubusercontent.com/DiogoCoutoooo/Cybersec-Obsidian/main/Tought%20Process/!Media/!Logo_Cap.png",
    "description": "Exposed IDOR vulnerability in the web dashboard allowed for the download of other users' network captures. Analysis of a specific PCAP file revealed cleartext FTP credentials. After gaining a shell, local enumeration showed that Python 3.8 was configured with dangerous capabilities (cap_setuid,cap_net_bind_service+eip). This misconfiguration allowed for an immediate privilege escalation to root by manipulating the process UID via a simple python script.",
    "matrix": {
      "ENUM": 50,
      "REAL": 40,
      "CVE": 40,
      "CUSTOM": 50,
      "CTF": 60
    },
    "folder": "Easy",
    "status": "PWNED"
  },
  {
    "id": "expressway",
    "title": "Expressway",
    "os": "Linux",
    "difficulty": "Easy",
    "pwnedDate": "18 Feb 2026",
    "avatar": "https://raw.githubusercontent.com/DiogoCoutoooo/Cybersec-Obsidian/main/Tought%20Process/!Media/!Logo_Expressway.png",
    "description": "Exposed IKE port allowed for aggressive mode sniffing, leading to the crack of a Pre-Shared Key (PSK). This provided access to a VPN tunnel where internal services were reachable. After pivoting, a cleartext password was found in a configuration file, granting SSH access. Final privilege escalation was achieved by exploiting a misconfigured SUID binary to execute commands as root.",
    "matrix": {
      "ENUM": 80,
      "REAL": 80,
      "CVE": 20,
      "CUSTOM": 30,
      "CTF": 60
    },
    "folder": "Easy",
    "status": "PWNED"
  }
]